sdaiGetMemberCount(Sdai_Id_aggr*)
\details
Retrieves the number of elements contained in a specified aggregate.
\param aggregate [in] An aggregate to get the number of elements.
\returns An SDAI integer value that contains the number of the aggregate elements.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiSY_ERR - Underlying system error.
\code
SdaiEntity entPropertySingleValue = sdaiGetEntity(model, "IfcPropertySingleValue");
SdaiSet propertySingleValues = sdaiGetEntityExtent(model, entPropertySingleValue);
SdaiInteger cnt = sdaiGetMemberCount(propertySingleValues);